yamaxgucci/esp32-os/sdkconfig.defaults.esp32s3
# ArgonOS - ESP32-S3 defaults (primary target).
#
# These assume an N16R8 style module: 16 MB flash, 8 MB octal PSRAM.
# Boards with quad PSRAM need CONFIG_SPIRAM_MODE_QUAD instead; that lives in
# the board pack, not here.

CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# PSRAM stays out of the general malloc pool: ArgonOS hands it out through
# per-process arenas and the executable app-text arena.
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# Deliberately NOT enabled: these copy the kernel's own code and constants into
# PSRAM at boot, which costs boot time and PSRAM and buys nothing here - both
# flash and PSRAM are reached through the same cache.  They are also unrelated
# to the application loader, which maps PSRAM into the instruction bus itself.
# CONFIG_SPIRAM_FETCH_INSTRUCTIONS
# CONFIG_SPIRAM_RODATA

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# UART0 is the one console every board and QEMU agree on, and the ROM
# bootloader already talks there, so early output is not split across two
# devices.  USB-serial-JTAG becomes an additional console endpoint at runtime
# once the console multiplexer exists.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
